etc/nix/home/profiles/editors/emacs/emacs/packages.el
;;; -*- no-byte-compile: t; -*-

;; [[file:config.org::*Rotate Windows][Rotate Windows:1]]
(package! rotate :pin "4e9ac3ff800880bd9b705794ef0f7c99d72900a6")
;; Rotate Windows:1 ends here

;; [[file:config.org::*Very Large Files][Very Large Files:1]]
(package! vlf :recipe (:host github :repo "m00natic/vlfi" :files ("*.el"))
  :pin "cc02f2533782d6b9b628cec7e2dcf25b2d05a27c" :disable t)
;; Very Large Files:1 ends here
