etc/nix/home/profiles/editors/emacs/emacs/packages.el

;; [[file:config.org::*Auto Activating Snippets][Auto Activating Snippets:1]]
(package! aas :recipe (:host github :repo "ymarco/auto-activating-snippets")
  :pin "1699bec4d244a1f62af29fe4eb8b79b6d2fccf7d")
;; Auto Activating Snippets:1 ends here

;; [[file:config.org::*ETrace][ETrace:1]]
(package! etrace :recipe (:host github :repo "aspiers/etrace"))
;; ETrace:1 ends here

;; [[file:config.org::*String Inflection][String Inflection:1]]
(package! string-inflection :pin "fd7926ac17293e9124b31f706a4e8f38f6a9b855")
;; String Inflection:1 ends here

;; [[file:config.org::*Info Colors][Info Colors:1]]
(package! info-colors :pin "47ee73cc19b1049eef32c9f3e264ea7ef2aaf8a5")
;; Info Colors:1 ends here

;; [[file:config.org::*Prettier Page Breaks][Prettier Page Breaks:1]]
(package! page-break-lines :recipe (:host github :repo "purcell/page-break-lines"))
;; Prettier Page Breaks:1 ends here

;; [[file:config.org::*Org][Org:1]]
(unpin! org-mode) ; there be bugs
(package! org-contrib
  :recipe (:host nil :repo "https://git.sr.ht/~bzg/org-contrib"
           :files ("lisp/*.el"))
  :pin "b8012e759bd5bf5da802b0b41734a8fec218323c")
;; Org:1 ends here
