etc/nix/home/profiles/editors/emacs/emacs/packages.el

;; [[file:config.org::*GUI][GUI:1]]
(unpin! doom-themes doom-modeline)
(package! solaire-mode :disable t)
(package! ox-chameleon :recipe (:host github :repo "tecosaur/ox-chameleon"))
;; GUI:1 ends here

;; [[file:config.org::*LSP][LSP:1]]
;; (unpin! lsp-mode)
;; (unpin! lsp-ui)
;; LSP:1 ends here

;; [[file:config.org::*Packages][Packages:1]]
;; (package! org-appear)
;; (package! doct :recipe (:host github :repo "progfolio/doct"))
;; (package! org-padding :recipe (:host github :repo "TonCherAmi/org-padding"))
;; (package! org-ol-tree :recipe (:host github :repo "Townk/org-ol-tree"))
;; (package! org-pretty-table :recipe (:host github :repo "Fuco1/org-pretty-table"))
;; (package! org-roam-ui :recipe (:host github :repo "org-roam/org-roam-ui" :files ("*.el" "out")))
;; (package! websocket)
;; Packages:1 ends here
